---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsEdgeHandle
source: html/2556f09d-f77b-a7c6-ebfe-747768ffa707.htm
---
# Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsEdgeHandle Method

Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'.

## Syntax (C#)
```csharp
public bool IsEdgeHandle()
```